In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/007.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                     3                     4
0       NaN  NaN  NaN  McGuire (R)  888,288  Baker (D)  1,185,366
1       NaN  NaN  NaN                 42.8%                 57.2%
2    County   PR   TP                   NaN                   NaN
3   APPLING   19   19                  1957                  1938
4  ATKINSON    6    6                   721                   700

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4
3   APPLING  19  19  1957  1938
4  ATKINSON   6   6   721   700
5     BACON   7   7  1043  1112
6     BAKER   7   7   269   665
7   BALDWIN  16  16  3243  6545

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4
3   APPLING  1957  1938
4  ATKINSON   721   700
5     BACON  1043  1112
6     BAKER   269   665
7   BALDWIN  3243  6545

In [9]:
df.columns = ['county', 'Perry McGuire', 'Thurbert Baker']

In [10]:
df.tail(5)

        county Perry McGuire Thurbert Baker
157  WHITFIELD          9588           6532
158     WILCOX           797           1107
159     WILKES           996           1625
160  WILKINSON           923           1806
161      WORTH          2150           2735

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county      candidate votes
0   APPLING  Perry McGuire  1957
1  ATKINSON  Perry McGuire   721
2     BACON  Perry McGuire  1043
3     BAKER  Perry McGuire   269
4   BALDWIN  Perry McGuire  3243

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [16]:
df['office'] = 'Attorney General'

In [17]:
df['district'] = ''

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Perry McGuire', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Thurbert Baker', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate       party
Perry McGuire   Republican     888288
Thurbert Baker  Democrat      1185366
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county            office district       party      candidate  votes
0   APPLING  Attorney General           Republican  Perry McGuire   1957
1  ATKINSON  Attorney General           Republican  Perry McGuire    721
2     BACON  Attorney General           Republican  Perry McGuire   1043
3     BAKER  Attorney General           Republican  Perry McGuire    269
4   BALDWIN  Attorney General           Republican  Perry McGuire   3243

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')